{
  "docstring": {
    "long_description": "The description of that function is as follows:\n\n    Compute the kurtosis (Fisher or Pearson) of a dataset.\n\n    Kurtosis is the fourth central moment divided by the square of the variance.\n    If Fisher's definition is used, then 3.0 is subtracted from the result to give 0.0 for a normal distribution.\n\n    If bias is False then the kurtosis is calculated using k statistics to eliminate bias coming from biased moment estimators\n\n    Use `kurtosistest` to see if result is close enough to normal.",
    "short_description": "The KURTOSIS node is based on a numpy or scipy function.",
    "parameters": [
      {
        "name": "a",
        "type": "array",
        "description": "Data for which the kurtosis is calculated."
      },
      {
        "name": "axis",
        "type": "int or None, default: 0",
        "description": "If an int, the axis of the input along which to compute the statistic.\nThe statistic of each axis-slice (e.g. row) of the input will appear in a\ncorresponding element of the output.\nIf None, the input will be raveled before computing the statistic."
      },
      {
        "name": "fisher",
        "type": "bool",
        "description": "If True, Fisher's definition is used (normal ==> 0.0).\nIf False, Pearson's definition is used (normal ==> 3.0)."
      },
      {
        "name": "bias",
        "type": "bool",
        "description": "If False, then the calculations are corrected for statistical bias."
      },
      {
        "name": "nan_policy",
        "type": "{'propagate', 'omit', 'raise'}",
        "description": "Defines how to handle input NaNs.\n- propagate : if a NaN is present in the axis slice (e.g. row) along\nwhich the  statistic is computed, the corresponding entry of the output will be NaN.\n- omit : NaNs will be omitted when performing the calculation.\nIf insufficient data remains in the axis slice along which the\nstatistic is computed, the corresponding entry of the output will be NaN.\n- raise : if a NaN is present, a ValueError will be raised."
      },
      {
        "name": "keepdims",
        "type": "bool, default: False",
        "description": "If this is set to True, the axes which are reduced are left\nin the result as dimensions with size one. With this option,\nthe result will broadcast correctly against the input array."
      }
    ],
    "returns": [
      {
        "name": null,
        "type": "DataContainer",
        "description": "type 'ordered pair', 'scalar', or 'matrix'"
      }
    ]
  }
}