{
  "docstring": {
    "long_description": "The description of that function is as follows:\n\n    Compute the sample skewness of a dataset.\n\n    For normally distributed data, the skewness should be about zero. \n    For unimodal continuous distributions, a skewness value greater than zero means that there is more weight in the right tail of the distribution.         The function 'skewtest' can be used to determine if the skewness value is close enough to zero, statistically speaking.",
    "short_description": "The SKEW node is based on a numpy or scipy function.",
    "parameters": [
      {
        "name": "a",
        "type": "ndarray",
        "description": "Input array."
      },
      {
        "name": "axis",
        "type": "int ",
        "description": "Default = 0.\nIf an int, the axis of the input along which to compute the statistic.\nThe statistic of each axis-slice (e.g. row) of the input will appear in a\ncorresponding element of the output.\nIf None, the input will be raveled before computing the statistic."
      },
      {
        "name": "bias",
        "type": "bool",
        "description": "If False, then the calculations are corrected for statistical bias."
      },
      {
        "name": "nan_policy",
        "type": "{'propagate', 'omit', 'raise'}",
        "description": "Defines how to handle input NaNs.\n- propagate : if a NaN is present in the axis slice (e.g. row) along\nwhich the statistic is computed, the corresponding entry of the output\nwill be NaN.\n- omit : NaNs will be omitted when performing the calculation.\nIf insufficient data remains in the axis slice along which the\nstatistic is computed, the corresponding entry of the output will be NaN.\n- raise : if a NaN is present, a ValueError will be raised."
      },
      {
        "name": "keepdims",
        "type": "bool, default: False",
        "description": "If this is set to True, the axes which are reduced are left\nin the result as dimensions with size one. With this option,\nthe result will broadcast correctly against the input array."
      }
    ],
    "returns": [
      {
        "name": null,
        "type": "DataContainer",
        "description": "type 'ordered pair', 'scalar', or 'matrix'"
      }
    ]
  }
}