{
  "docstring": {
    "long_description": "This block is similar to MEASUREMENTS_MDO3XXX block but more measurements\nare availble. The available measurements are as follows:\n\namplitude, area, burst, carea, cmean, crms, delay, distduty, extinctdb,\nextinctpct, extinctratio, eyeheight, eyewidth, fall, frequency, high, hits,\nlow, maximum, mean, median, minimum, ncross, nduty, novershoot, nwidth,\npbase, pcross, pctcross, pduty, peakhits, period, phase, pk2pk, pkpkjitter,\npkpknoise, povershoot, ptop, pwidth, qfactor, rise, rms, rmsjitter,\nrmsnoise, sigma1, sigma2, sigma3, sixsigmajit, snratio, stddev, undefined,\nwaveforms\n\nAlso available are 5 statistic modes:\ninstant, mean, max, min, and stdev where instant is a single measurement\nand stdev is the standard deviation of the mean.\n\nRequires a CONNECTION_MDO3XXX block at the start of the app to connect with\nthe instrument. The VISA address will then be listed under 'connection'.\n\nThis block should also work with compatible Tektronix scopes (untested):\nMDO4xxx, MSO4xxx, and DPO4xxx. Many of the advanced measurements are likely\nto not function with different model numbers.",
    "short_description": "Extract waveform measurements from an MDO3xxx oscilloscope.",
    "parameters": [
      {
        "name": "connection",
        "type": "VisaConnection",
        "description": "The VISA address (requires the CONNECTION_MDO3XXX block)."
      },
      {
        "name": "channel",
        "type": "int",
        "description": "The channel with which to create a measurement for."
      },
      {
        "name": "measurement",
        "type": "str",
        "description": "The measurement to make."
      },
      {
        "name": "statistic",
        "type": "str",
        "description": "The type of statistic to take for the measurement."
      }
    ],
    "returns": [
      {
        "name": null,
        "type": "DataContainer",
        "description": "Scalar: The measurement from the oscilloscope channel."
      }
    ]
  },
  "videos": [
    {
      "title": "Control Oscilloscope with Flojoy",
      "source": "youtube",
      "link": "https://www.youtube.com/watch?v=NqPW7pG3NZs"
    }
  ],
  "thumbnail": "https://www.tek.com/en/products/oscilloscopes/mdo3000#"
}