{
  "docstring": {
    "long_description": "The description of that function is as follows:\n\n    Calculate the nth moment about the mean for a sample.\n\n    A moment is a specific quantitative measure of the shape of a set of points.\n    It is often used to calculate coefficients of skewness and kurtosis due to its close relationship with them.",
    "short_description": "The MOMENT node is based on a numpy or scipy function.",
    "parameters": [
      {
        "name": "a",
        "type": "array_like",
        "description": "Input array."
      },
      {
        "name": "moment",
        "type": "int or array_like of ints",
        "description": "Order of central moment that is returned.\nDefault is 1."
      },
      {
        "name": "axis",
        "type": "int or None, default: 0",
        "description": "If an int, the axis of the input along which to compute the statistic.\nThe statistic of each axis-slice (e.g. row) of the input will appear in a\ncorresponding element of the output.\nIf None, the input will be raveled before computing the statistic."
      },
      {
        "name": "nan_policy",
        "type": "{'propagate', 'omit', 'raise'}",
        "description": "Defines how to handle input NaNs.\n- propagate : if a NaN is present in the axis slice (e.g. row) along\nwhich the statistic is computed, the corresponding entry of the output will be NaN.\n- omit : NaNs will be omitted when performing the calculation.\nIf insufficient data remains in the axis slice along which the\nstatistic is computed, the corresponding entry of the output will be NaN.\n- raise : if a NaN is present, a ValueError will be raised."
      },
      {
        "name": "keepdims",
        "type": "bool, default: False",
        "description": "If this is set to True, the axes which are reduced are left\nin the result as dimensions with size one. With this option,\nthe result will broadcast correctly against the input array."
      }
    ],
    "returns": [
      {
        "name": null,
        "type": "DataContainer",
        "description": "type 'ordered pair', 'scalar', or 'matrix'"
      }
    ]
  }
}